In [1]:
import pandas as pd

In [2]:
data = [[1, 100, 2008, 10, 5000], [2, 100, 2009, 12, 5000], [7, 200, 2011, 15, 9000]]
sales = pd.DataFrame(data, columns=['sale_id', 'product_id', 'year', 'quantity', 'price']).astype({'sale_id':'Int64', 'product_id':'Int64', 'year':'Int64', 'quantity':'Int64', 'price':'Int64'})
data = [[100, 'Nokia'], [200, 'Apple'], [300, 'Samsung']]
product = pd.DataFrame(data, columns=['product_id', 'product_name']).astype({'product_id':'Int64', 'product_name':'object'})

In [3]:
sales

   sale_id  product_id  year  quantity  price
0        1         100  2008        10   5000
1        2         100  2009        12   5000
2        7         200  2011        15   9000

In [4]:
product

   product_id product_name
0         100        Nokia
1         200        Apple
2         300      Samsung

Write a solution to select the product id, year, quantity, and price for the first year of every product sold.

Return the resulting table in any order.

The result format is in the following example.

| product_id | first_year | quantity | price |
|------------|------------|----------|-------| 
| 100        | 2008       | 10       | 5000  |
| 200        | 2011       | 15       | 9000  |

In [8]:
first_year=sales.groupby(by="product_id")["year"].min().reset_index(name="first_year")
first_year

   product_id  first_year
0         100        2008
1         200        2011

In [11]:
first_year.merge(right=sales, left_on=["product_id","first_year"], right_on=["product_id","year"], how="left") \
    .drop(labels=["year","sale_id"],axis=1)

   product_id  first_year  quantity  price
0         100        2008        10   5000
1         200        2011        15   9000